# Pandas kütüphanesinden 10 fonksiyon örneği

In [2]:
import pandas as pd

1) read_csv() : CSV dosyasını DataFrame olarak okur.

In [5]:
df = pd.read_csv("Chocolate Sales.csv")

2. head() : İlk n satırı gösterir (Parametresiz kullanılırsa ilk 5 satır gösterilir.)

In [9]:
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [11]:
df.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",38
6,Oby Sorrel,UK,99% Dark & Pure,25-Jan-22,"$13,685",176
7,Gunar Cockshoot,Australia,After Nines,24-Mar-22,"$3,080",73
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,"$3,990",59
9,Brien Boise,Australia,99% Dark & Pure,04-Jul-22,"$2,835",102

3. info() : DataFrame hakkında veri türü,eksik bilgiler gibi genel bilgileri verir.

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   object
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: int64(1), object(5)
memory usage: 51.4+ KB

4. describe() : Sayısal sütunlar için özet istatistikler döndürür.

In [18]:
df.describe()

       Boxes Shipped
count    1094.000000
mean      161.797989
std       121.544145
min         1.000000
25%        70.000000
50%       135.000000
75%       228.750000
max       709.000000

5. isnull().sum() : Eksik değerleri kontrol eder ve toplamını gösterir.

In [21]:
df.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

6. fillna(): Eksik değerleri parametre içine yazılan değer ile doldurur.

In [25]:
df.fillna(0, inplace=True)

7. dropna(): Eksik değer içeren sütunları siler.

In [28]:
df.dropna(inplace=True)

8. groupby(): Belirtilen sütunlara göre gruplama yapar.

In [42]:
df.groupby("Country")["Product"].sum()

Country
Australia      $12,726 $3,080 $2,835 $6,790 $6,888 $7,672 $4,...
Canada         $1,442 $4,067 $8,799 $1,652 $2,163 $4,781 $7,6...
India          $7,896 $4,501 $5,376 $168 $2,443 $6,307 $4,382...
New Zealand    $3,990 $168 $8,379 $9,492 $5,061 $1,722 $147 $...
UK             $5,320 $13,685 $13,685 $4,704 $1,085 $3,003 $1...
USA            $3,703 $3,017 $1,267 $4,753 $4,025 $9,583 $938...
Name: Amount, dtype: object

9. apply(): Özel fonksiyonları satır veya sütuna özel olarak uygular.

In [50]:
df["Boxes Shipped"]=df["Amount"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1094 entries, 0 to 1093
Series name: Amount
Non-Null Count  Dtype
--------------  -----
1094 non-null   object
dtypes: object(1)
memory usage: 8.7+ KB

10. value_counts(): Bir sütundaki eşsiz değerlerin frekansını sayar.

In [54]:
df["Product"].value_counts()

Product
50% Dark Bites          60
Eclairs                 60
Smooth Sliky Salty      59
White Choc              58
Drinking Coco           56
Spicy Special Slims     54
Organic Choco Syrup     52
After Nines             50
85% Dark Bars           50
Fruit & Nut Bars        50
Milk Bars               49
Peanut Butter Cubes     49
99% Dark & Pure         49
Almond Choco            48
Raspberry Choco         48
Orange Choco            47
Mint Chip Choco         45
Manuka Honey Choco      45
Caramel Stuffed Bars    43
70% Dark Bites          42
Baker's Choco Chips     41
Choco Coated Almonds    39
Name: count, dtype: int64